app/views/content_items/_form.html.erb

  <ul>
    <% content_item.user.social_networks.each do |network| %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "social_networks".* FROM "social_networks" WHERE "social_networks"."user_id" = $1  [["user_id", 1]]