app/controllers/content_items_controller.rb

  def index
    @content_items = current_user.content_items
    if (params[:search])
      @content_items = @content_items.where("lower(title) like ?", "%#{params[:search].downcase}%")
---
SELECT "content_items".* FROM "content_items" WHERE "content_items"."user_id" = $1  [["user_id", 1]]